# -*- coding: utf-8 -*-

"""
    @Author 坦克手贝塔
    @Date 2023/5/17 17:03
"""
import re

print("====================案例1===========================")
# 匹配出一个字符串，首字母为大写，后面都是小写字母，这些小写字母可有可无
pattern = "[A-Z][a-z]*"
s = "Hello"
o = re.match(pattern, s)
print(o)
print("====================案例2===========================")
# 匹配有效的变量名，（字母、数字、下划线，而且数字不能开头）
pattern = "[A-Za-z_]\w*"
s = "_er"
o = re.match(pattern, s)
print(o)
print("====================案例3===========================")
# 匹配有1-99之间的数字
pattern = "[1-9]\d{0,1}"
s = "19"
o = re.match(pattern, s)
print(o)
print("====================案例4===========================")
# 匹配一个随机密码8-20位以内（大写字母，小写字母，下划线，数字）
pattern = "\w{8,20}"
s = "19999999"
o = re.match(pattern, s)
print(o)
